In [1]:
import pandas as pd

In [4]:
df_01 = pd.read_csv('../data/zippedData/tn.movie_budgets.csv.gz')
df_02 = pd.read_csv('../data/zippedData/imdb.title.basics.csv.gz')

In [5]:
df_01.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [6]:
df_01.shape

(5782, 6)

In [11]:
df_02.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [12]:
df_02.shape

(146144, 6)

In [13]:
df_01.keys()

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [15]:
plot_02 = df_01.drop(['id', 'movie','production_budget', 'worldwide_gross'], axis = 1)

In [16]:
plot_02.head()

   release_date domestic_gross
0  Dec 18, 2009   $760,507,625
1  May 20, 2011   $241,063,875
2   Jun 7, 2019    $42,762,350
3   May 1, 2015   $459,005,868
4  Dec 15, 2017   $620,181,382

In [17]:
plot_02.to_csv('../data/zippedData/Processed/plot_02.csv')